emacs.d/config.org
#+AUTHOR: Lucas Elvira
#+DATE 2023-03-19
#+EXPORTS_FILE_NAME: config.html
#+STARTUP: showeverything

* :TOC:
- [[#put-this-in-your-initel][PUT THIS IN YOUR init.el]]
- [[#autorun][AUTORUN]]
  - [[#emacs-as-server][Emacs as server]]
  - [[#which-key][which key]]
- [[#install-packages][Install packages]]
  - [[#setup-melpa-to-enable-install-package][setup melpa to enable install package]]
  - [[#setup-straight][Setup straight]]
  - [[#install-some-package][install some package]]
- [[#ivy-posframe][Ivy-posframe]]
- [[#registers][REGISTERS]]
- [[#file-manager][File manager]]
  - [[#open-dired][Open dired]]
  - [[#keybinding-within-dired][Keybinding within dired]]
  - [[#keybinding-for-peep-dired-mode][Keybinding for peep-dired-mode]]
- [[#keep-folders-clean][keep folders clean]]
- [[#files][Files]]
  - [[#keybindings-for-files][Keybindings for files]]
  - [[#useful-file-functions][Useful file functions]]
- [[#customize-ui][Customize UI]]
  - [[#display-line-numbers][display line numbers]]
  - [[#clean-ui][clean ui]]
  - [[#install-some-themes-and-enable-it][Install some themes and enable it]]
  - [[#buffers-and-bookmarks][Buffers and bookmarks]]
- [[#customization][Customization]]
  - [[#truncate-lines-in-text-mode][Truncate lines in text mode]]
- [[#dashboard][DASHBOARD]]
  - [[#launch-dashboard-by-default-when-launch-emacs][Launch dashboard by default when launch emacs]]
  - [[#shortcuts][Shortcuts]]
  - [[#disable--of-m-x][Disable '^' of M-x]]
  - [[#disable-mouse][Disable mouse]]
- [[#org-mode][ORG MODE]]
  - [[#org-links][Org links]]
  - [[#source-code-blocks][Source code blocks]]
  - [[#configure-some-vars][Configure some vars]]
  - [[#org-capture][Org capture]]
  - [[#org-toc][Org toc]]
  - [[#org-export-manpage][Org export manpage]]
  - [[#org-roam][Org-roam]]
  - [[#org-babel][ORG-BABEL]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
  - [[#skeletons][Skeletons]]
- [[#custom-hooks][Custom hooks]]

* PUT THIS IN YOUR init.el

#+begin_example
(org-babel-load-file
(expand-file-name
  "config.org"
  user-emacs-directory))
#+end_example
* AUTORUN
** Emacs as server

This command allow to run emacs as server, so all the startup can be done once
time and connect client to it each time you need
#+begin_src emacs-lisp
  (server-start)
#+end_src
*** Connect a client
To connect a client to the server you need to run

#+begin_example shell
emacsclient --create-frame --alternate-editor=""
# or use an alias
export ALTERNATE_EDITOR=""
export EDITOR="emacsclient -t"                  # $EDITOR opens in terminal
export VISUAL="emacsclient -c -a emacs"         # $VISUAL opens in GUI mode
#+end_example


** which key
Which key is a minor mode that displays the keybinding following your currently
entered incomplete command in a popup
#+begin_src emacs-lisp
(use-package which-key
    :init
    (setq which-key-side-window-location 'bottom
          which-key-sort-order #'which-key-key-order-alpha
          which-key-sort-uppercase-first nil
          which-key-add-column-padding 1
          which-key-max-display-columns nil
          which-key-min-display-lines 6
          which-key-side-window-slot -10
          which-key-side-window-max-height 0.25
          which-key-idle-delay 0.8
          which-key-max-description-length 25
          which-key-allow-imprecise-window-fit t
          which-key-separator " → " ))
(which-key-mode)
#+end_src

* Install packages
** setup melpa to enable install package
#+begin_src emacs-lisp

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("org" . "https://orgmode.org/elpa/") t)

(unless package-archive-contents
  (package-refresh-contents))

(package-initialize)

(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

** Setup straight
Straight is a packages manager that enables you to directly install Emacs packages
from git repositories

#+begin_src emacs-lisp

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

#+end_src


** install some package
*** general
General is a package that allows to setup your desired keybinding

#+begin_src emacs-lisp
(use-package general
    :config
    (general-evil-setup t))
#+end_src

*** Startup performance

#+begin_src emacs-lisp
(use-package gcmh
:config
(gcmh-mode 1))
;; Setting garbage collection threshold
(setq gc-cons-threshold 402653184
    gc-cons-percentage 0.6)

;; Profile emacs startup
(add-hook 'emacs-startup-hook
        (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                    (format "%.2f seconds"
                            (float-time
                            (time-subtract after-init-time before-init-time)))
                    gcs-done)))

(setq gc-cons-threshold (* 50 1000 1000))

(defun efs/display-startup-time ()
(message "Emacs loaded in %s with %d garbage collections."
        (format "%.2f seconds"
                (float-time
                    (time-subtract after-init-time before-init-time)))
        gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)

#+end_src

*** ivy as completion mechanism

#+begin_src emacs-lisp
;; Ivy is a completion mechanism for Emacs. Ivy-rich allows you to add descriptions alongside the command M-x

(use-package counsel
    :after ivy
    :config (counsel-mode))
(use-package ivy
    :defer 0.1
    :diminish
    :bind
    (("C-c C-r" . ivy-resume)
    ("C-x B" . ivy-switch-buffer-other-window))
    :custom
    (setq ivy-count-format "(%d/%d) ")
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    :config
    (ivy-mode))
(use-package ivy-rich
    :after ivy
    :custom
    (ivy-virtual-abbreviate 'full
    ivy-rich-switch-buffer-align-virtual-buffer t
    ivy-rich-path-style 'abbrev)
    :config
    (ivy-set-display-transformer 'ivy-switch-buffer
                                'ivy-rich-switch-buffer-transformer)
    (ivy-rich-mode 1)) ;; this gets us descriptions in M-x.
(use-package swiper
    :after ivy
    :bind (("C-s" . swiper)
            ("C-r" . swiper)))
(setq ivi-initial-inputs-alist nil)
#+end_src

*** Install Smex
Smex is a package that makes M-x remember out history
#+begin_src emacs-lisp
(use-package smex)
(smex-initialize)
#+end_src

*** Flycheck to highlight errors
#+begin_src emacs-lisp
(use-package flycheck)
(flycheck-mode)
#+end_src

*** Copilot (not official)
#+begin_src emacs-lisp
(use-package copilot
  :straight (:host github :repo "zerolfx/copilot.el"
                   :files ("dist" "copilot.el"))
  :ensure t)

(add-hook 'prog-mode-hook 'copilot-mode)

#+end_src

**** Use copilot with company-mode

#+begin_src emacs-lisp
(with-eval-after-load 'company
  ;; disable inline previews
  (delq 'company-preview-if-just-one-frontend company-frontends))
  
(define-key copilot-completion-map (kbd "<tab>") 'copilot-accept-completion)
(define-key copilot-completion-map (kbd "TAB") 'copilot-accept-completion)

#+end_src


* Ivy-posframe
Ivy-posframe is an ivy extension, which lets ivy use posframe to show its candidate menu.  Some of the settings below involve:
- ivy-posframe-display-functions-alist -- sets the display position for specific programs
- ivy-posframe-height-alist -- sets the height of the list displayed for specific programs

Available functions (positions) for 'ivy-posframe-display-functions-alist'
- ivy-posframe-display-at-frame-center
- ivy-posframe-display-at-window-center
- ivy-posframe-display-at-frame-bottom-left
- ivy-posframe-display-at-window-bottom-left
- ivy-posframe-display-at-frame-bottom-window-center
- ivy-posframe-display-at-point
- ivy-posframe-display-at-frame-top-center

=NOTE:= If the setting for 'ivy-posframe-display' is set to 'nil' (false), anything that is set to 'ivy-display-function-fallback' will just default to their normal position in Doom Emacs (usually a bottom split).  However, if this is set to 't' (true), then the fallback position will be centered in the window.

#+begin_src emacs-lisp
  (use-package ivy-posframe
    :init
    (setq ivy-posframe-display-functions-alist
      '((swiper                     . ivy-posframe-display-at-point)
        (complete-symbol            . ivy-posframe-display-at-point)
        (counsel-M-x                . ivy-display-function-fallback)
        (counsel-esh-history        . ivy-posframe-display-at-window-center)
        (counsel-describe-function  . ivy-display-function-fallback)
        (counsel-describe-variable  . ivy-display-function-fallback)
        (counsel-find-file          . ivy-display-function-fallback)
        (counsel-recentf            . ivy-display-function-fallback)
        (counsel-register           . ivy-posframe-display-at-frame-bottom-window-center)
        (dmenu                      . ivy-posframe-display-at-frame-top-center)
        (nil                        . ivy-posframe-display))
      ivy-posframe-height-alist
      '((swiper . 20)
        (dmenu . 20)
        (t . 10)))
    :config
    (ivy-posframe-mode 1)) ; 1 enables posframe-mode, 0 disables it.
#+end_src

*** Install projectle
#+begin_src emacs-lisp

(use-package projectile
:config
(projectile-mode +1))
#+end_src

