emacs.d/config.org
*** Setup evil mode
evil mode setup the vim keybinding
#+begin_src emacs-lisp

(use-package evil
:init      ;; tweak evil's configuration before loading it
;;  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
(setq evil-want-keybinding nil)
(setq evil-vsplit-window-right t)
(setq evil-split-window-below t)
(evil-mode)
)
(use-package evil-collection
 :after evil
 :config
 (setq evil-collection-mode-list '(dashboard dired ibuffer))
 (evil-collection-init))
 (use-package evil-tutor)
 (evil-mode t)
#+end_src

*** Install magit
Magit is a client for emacs
#+begin_src emacs-lisp
(setq bare-git-dir (concat "--git-dir=" (expand-file-name "~/.dotfiles")))
(setq bare-work-tree (concat "--work-tree=" (expand-file-name "~")))
;; use maggit on git bare repos like dotfiles repos, don't forget to change `bare-git-dir' and `bare-work-tree' to your needs
(defun me/magit-status-bare ()
"set --git-dir and --work-tree in `magit-git-global-arguments' to `bare-git-dir' and `bare-work-tree' and calls `magit-status'"
(interactive)
(require 'magit-git)
(add-to-list 'magit-git-global-arguments bare-git-dir)
(add-to-list 'magit-git-global-arguments bare-work-tree)
(call-interactively 'magit-status))

;; if you use `me/magit-status-bare' you cant use `magit-status' on other other repos you have to unset `--git-dir' and `--work-tree'
;; use `me/magit-status' insted it unsets those before calling `magit-status'
(defun me/magit-status ()
"removes --git-dir and --work-tree in `magit-git-global-arguments' and calls `magit-status'"
(interactive)
(require 'magit-git)
(setq magit-git-global-arguments (remove bare-git-dir magit-git-global-arguments))
(setq magit-git-global-arguments (remove bare-work-tree magit-git-global-arguments))
(call-interactively 'magit-status))

(use-package magit)

#+end_src

*** Files utilities

#+begin_src emacs-lisp
;;(use-package recentf
;;    :config
;;    (recentf-mode))
(use-package sudo-edit) ;; Utilities for opening files with sudo
#+end_src

*** Auto-complete
autocomplete engineering

#+begin_src emacs-lisp
(use-package company)
(company-mode)
#+end_src

*** cdlatex
cdlatex is a package that allows to display inline math expressions in latex
with the cdlatex mode
#+begin_src emacs-lisp
(use-package cdlatex)
(add-hook 'org-mode-hook #'turn-on-org-cdlatex)
#+end_src
*** some languages modes
#+begin_src emacs-lisp
(use-package markdown-mode)
(use-package web-mode)
#+end_src
**** plantuml need more configuration
#+begin_src emacs-lisp
(use-package plantuml-mode)
;; Sample jar configuration
(setq plantuml-jar-path "/opt/plantuml-1.2023.4.jar")
(setq plantuml-default-exec-mode 'jar)
#+end_src
**** Language server protocol
Language server protocol is an open protocol for use between source code editors
and servers that provide programming languages for some features

#+begin_src emacs-lisp
(use-package lsp-mode)
(use-package lsp-ui)

#+end_src

*** NEOTREE
Neotree is a file tree viewer.  When you open neotree, it jumps to the current
file thanks to neo-smart-open.  The neo-window-fixed-size setting makes the
neotree width be adjustable.  NeoTree provides following themes: classic, ascii,
arrow, icons, and nerd.  Theme can be configed by setting "two" themes for
neo-theme: one for the GUI and one for the terminal.  I like to use 'SPC t' for
'toggle' keybindings, so I have used 'SPC t n' for toggle-neotree.

| COMMAND        | DESCRIPTION               | KEYBINDING |
|----------------+---------------------------+------------|
| neotree-toggle | /Toggle neotree/            | SPC t n    |
| neotree- dir   | /Open directory in neotree/ | SPC d n    |

#+BEGIN_SRC emacs-lisp
;; Function for setting a fixed width for neotree.
;; Defaults to 25 but I make it a bit longer (35) in the 'use-package neotree'.
(defcustom neo-window-width 25
  "*Specifies the width of the NeoTree window."
  :type 'integer
  :group 'neotree)

(use-package neotree
  :config
  (setq neo-smart-open t
        neo-window-width 30
        neo-theme (if (display-graphic-p) 'icons 'arrow)
        ;;neo-window-fixed-size nil
        inhibit-compacting-font-caches t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))

;; show hidden files
(setq-default neo-show-hidden-files t)

(nvmap :prefix "SPC"
       "t n"   '(neotree-toggle :which-key "Toggle neotree file viewer")
       "d n"   '(neotree-dir :which-key "Open directory in neotree"))
#+END_SRC

* REGISTERS
Emacs registers are compartments where you can save text, rectangles and positions for later use. Once you save text or a rectangle in a register, you can copy it into the buffer once or many times; once you save a position in a register, you can jump back to that position once or many times.  The default GNU Emacs keybindings for these commands (with the exception of counsel-register) involves 'C-x r' followed by one or more other keys.  I wanted to make this a little more user friendly, so I chose to replace the 'C-x r' part of the key chords with 'SPC r'.

| COMMAND                          | DESCRIPTION                      | KEYBINDING |
|----------------------------------+----------------------------------+------------|
| copy-to-register                 | /Copy to register/                 | SPC r c    |
| frameset-to-register             | /Frameset to register/             | SPC r f    |
| insert-register                  | /Insert contents of register/      | SPC r i    |
| jump-to-register                 | /Jump to register/                 | SPC r j    |
| list-registers                   | /List registers/                   | SPC r l    |
| number-to-register               | /Number to register/               | SPC r n    |
| counsel-register                 | /Interactively choose a register/  | SPC r r    |
| view-register                    | /View a register/                  | SPC r v    |
| window-configuration-to-register | /Window configuration to register/ | SPC r w    |
| increment-register               | /Increment register/               | SPC r +    |
| point-to-register                | /Point to register/                | SPC r SPC  |

#+begin_src emacs-lisp
(nvmap :prefix "SPC"
       "r c"   '(copy-to-register :which-key "Copy to register")
       "r f"   '(frameset-to-register :which-key "Frameset to register")
       "r i"   '(insert-register :which-key "Insert register")
       "r j"   '(jump-to-register :which-key "Jump to register")
       "r l"   '(list-registers :which-key "List registers")
       "r n"   '(number-to-register :which-key "Number to register")
       "r r"   '(counsel-register :which-key "Choose a register")
       "r v"   '(view-register :which-key "View a register")
       "r w"   '(window-configuration-to-register :which-key "Window configuration to register")
       "r +"   '(increment-register :which-key "Increment register")
       "r SPC" '(point-to-register :which-key "Point to register"))
#+end_src

* File manager
Dired is the file manager whitin emacs. Below there is some custom keybinding
** Open dired
| Command    | Description                     | KEYBINDING |
| dired      | open dired                      | SPC d d    |
| dired-jump | open dired at current directory | SPC d j    |
** Keybinding within dired
| Command            | Description           | KEYBINDING |
| dired-view-file    | view files in dired   | SPC d v    |
| dired-up-directory | go up one dir         | h          |
| dired-find-file    | go down one directory | l          |

** Keybinding for peep-dired-mode
| Command              | Description    | KEYBINDING |
| peep-dired           | Toggle preview | SPC d p   |
| peep-dired-next-file | Next file      | n          |
| peep-dired-prev-file | Previous file  | p          |

#+begin_src emacs-lisp
(use-package all-the-icons-dired)
(use-package dired-open)
(use-package peep-dired)
(nvmap :states '(normal visual) :keymaps 'override :prefix "SPC"
                "d d" '(dired :which-key "Open dired")
                "d j" '(dired-jump :which-key "Dired jump to current")
                "d p" '(peep-dired :which-key "Peep-dired"))

(with-eval-after-load 'dired
(define-key dired-mode-map (kbd "M-p") 'peep-dired)
(evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
(evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
(evil-define-key 'normal peep-dired-mode-map (kbd "n") 'peep-dired-next-file)
(evil-define-key 'normal peep-dired-mode-map (kbd "p") 'peep-dired-prev-file))

(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
;; Get file icons in dired
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
;; With dired-open plugin, you can launch external programs for certain extensions
;; For example, I set all .png files to open in 'sxiv' and all .mp4 files to open in 'mpv'
(setq dired-open-extensions '(("gif" . "sxiv")
                            ("jpg" . "sxiv")
                            ("png" . "sxiv")
                            ("mkv" . "mpv")
                            ("mp4" . "mpv")
                            ("pdf" . "evince")))
#+end_src


* keep folders clean
#+begin_src emacs-lisp
(use-package no-littering)

;; no-littering doesn't set this by default so we must place
;; auto save files in the same path as it uses for sessions
(setq auto-save-file-name-transforms
    `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))   

#+end_src
* Files
