emacs.d/config.org
** Org capture
#+begin_src emacs-lisp
(setq org-capture-templates
      '(
            ("t" "Todo" entry (file+headline org-default-todos-file "Tasks.org")
                "* TODO %?\n  %i\n  %a")
            ("n" "Note" entry (file+headline org-default-notes-file "Notes.org")
                "* %?\n  %i\n  %a")
            ("j" "Journal" entry (file+datetree org-default-journal-file)
                "* %?\nEntered on %U\n  %i\n  %a")
         ))
#+end_src

Also we can define a template for org roam
#+begin_src emacs-lisp

(setq org-roam-capture-templates
      '(
        ("f" "Fleeting note" plain "%?"
        :target (file+head "01_FLEETING_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
            "#+title: ${title}\n")
            :unnarrowed t)
        ("l" "Literature note" plain "%?"
          :target (file+head "02_LITERATURE_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        ("p" "Permanent note" plain "%?"
          :target (file+head "03_PERMANENT_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        ("i" "Index note" plain "%?"
          :target (file+head "04_INDEX_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        )
      )

#+end_src
And insert some key binding
#+begin_src  emacs-lisp
(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)
(global-set-key (kbd "C-c r o") #'org-roam-node-find)
(global-set-key (kbd "C-c r i") #'org-id-get-create)

(use-package org-journal
    :ensure nil)
#+end_src

#+RESULTS:

** Org toc
#+begin_src emacs-lisp
(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Org export manpage
#+begin_src emacs-lisp
(use-package ox-man
  :ensure nil)
#+end_src

*** Org export to markdown
#+begin_src emacs-lisp
(use-package ox-gfm)
#+end_src
** Org-roam
#+begin_src emacs-lisp
(use-package org-roam)
(setq org-roam-directory (file-truename "~/Documents/Org2/"))
#+end_src
*** org-roam-ui
#+begin_src emacs-lisp
(use-package org-roam-ui)
#+end_src

** ORG-BABEL
#+begin_src emacs-lisp
(org-babel-do-load-languages
    'org-babel-load-languages
    '((python . t)
))
#+end_src
** Source Code Block Tag Expansion
Org-tempo is a package that allows for '<s' followed by TAB to expand to a begin_src tag.  Other expansions available include:

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

#+begin_src emacs-lisp
(use-package org-tempo
  :ensure nil) ;; tell use-package not to try to install org-tempo since it's already there.
#+end_src

** Skeletons
Skeleton is very powerful special-purpose mini-language implemented in
EmacsLisp. Typically, skeletons are used in conjunction with AbbrevMode for
automatic insertion of customized templates and such 

*** Journal template skeleton
#+begin_src emacs-lisp
(define-skeleton journla-skeleton
"This is a template to be launch in journal-mode"
"* DAY: " str | " insert day " " \n"
"_____"
"* Objetivos del día\n\n"
"* Cosas buenas de hoy\n\n"
"* Algo que haya aprendido\n\n"
"* Objetivos para mañana\n")
;; launch the skeleton with ^C-jr
#+end_src


* Custom hooks
A hook is a function that is launched when some event occur. In this section
will be some hooks that will be launch in some modes

#+begin_src emacs-lisp
(add-hook  'text-mode-hook (lambda () (flyspell-mode)))



#+end_src
