emacs.d/config.el

(setq org-capture-templates
      '(
            ("t" "Todo" entry (file+headline org-default-todos-file "Tasks.org")
                "* TODO %?\n  %i\n  %a")
            ("n" "Note" entry (file+headline org-default-notes-file "Notes.org")
                "* %?\n  %i\n  %a")
            ("j" "Journal" entry (file+datetree org-default-journal-file)
                "* %?\nEntered on %U\n  %i\n  %a")
         ))

(setq org-roam-capture-templates
      '(
        ("f" "Fleeting note" plain "%?"
        :target (file+head "01_FLEETING_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
            "#+title: ${title}\n")
            :unnarrowed t)
        ("l" "Literature note" plain "%?"
          :target (file+head "02_LITERATURE_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        ("p" "Permanent note" plain "%?"
          :target (file+head "03_PERMANENT_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        ("i" "Index note" plain "%?"
          :target (file+head "04_INDEX_NOTES/%<%Y%m%d%H%M%S>-${slug}.org"
          "#+title: ${title}\n") :unnarrowed t)
        )
      )

(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)
(global-set-key (kbd "C-c r o") #'org-roam-node-find)
(global-set-key (kbd "C-c r i") #'org-id-get-create)

(use-package org-journal
    :ensure nil)

(use-package toc-org
  :commands toc-org-enable
  :init (add-hook 'org-mode-hook 'toc-org-enable))

(use-package ox-man
  :ensure nil)

(use-package ox-gfm)

(use-package org-roam)
(setq org-roam-directory (file-truename "~/Documents/Org2/"))

(use-package org-roam-ui)

(org-babel-do-load-languages
    'org-babel-load-languages
    '((python . t)
))

(use-package org-tempo
  :ensure nil) ;; tell use-package not to try to install org-tempo since it's already there.

(define-skeleton journla-skeleton
"This is a template to be launch in journal-mode"
"* DAY: " str | " insert day " " \n"
"_____"
"* Objetivos del día\n\n"
"* Cosas buenas de hoy\n\n"
"* Algo que haya aprendido\n\n"
"* Objetivos para mañana\n")
;; launch the skeleton with ^C-jr

(add-hook  'text-mode-hook (lambda () (flyspell-mode)))
